---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.InvalidComplexCut
source: html/e7385af7-01dd-3506-8382-656fdb61d3a0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.InvalidComplexCut Property

The family [Family Name] was containing one or more invalid cuts, which have been removed (most likely it was cutting
 a curtain wall). Please examine the family and make changes as needed.\r\nHint 1: If you are trying to cut a Curtain
 Wall, you may be able to achieve the desired result by editing the Elevation Profile or the curtain panel.\r\n
 Hint 2: If you can't see the family, you can still select it from the Project Browser.\r\nHint 3: This warning will
 disappear after you edit and then finish the family.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidComplexCut { get; }
```